---
type: GridNode
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# GridNode

`Autodesk.Revit.DB.GridNode` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | GridNode | — | `public GridNode ( int uIndex , int vIndex )` |
| Property | UIndex | — | `public int UIndex { get ; set ; }` |
| Property | VIndex | — | `public int VIndex { get ; set ; }` |